# -*- coding: utf-8 -*-
#한글을 코드 내 사용시 맨상단에 현재 코드의 인코딩방식을 표기 -> 대부분 utf-8사용
# -> 주석

#스크립트 언어
#라인 단위로 해석하여 수행

#장점
#개발 시간이 단축
#소스코드의 수정이 빠르고 간단하게 이루어진다.

#단점
#중간 코드를 만드는 것은 간단하지만 그것을 실제로 실행시키는 것은 많은 작업을 필요
#실행 시간이 오래걸린다.

#Python의 특징
#대화 기능의 인터프리터 언어
#동적인 데이터 타입 결정 지원
#플랫폼 독립적 언어
#개발 기간 단축에 촛점을 둔 언어
#간단하고 쉬운 문법
#고수준의 내장 객체 자료형 제공
#메모리 자동관리
#쉬운 유지보수
#많은 수의 라이브러리 제공
#짧아지는 코드
#높은 확장성

#활용처
#시스템 유틸리티, 게임, 웹 등

#장점
#들여쓰기를 강제화하여 코드의 가독성을 높였고, 코드의 재사용이 쉬움


print 4 + 5
print 12 -32
print (4 + 5) * 6
print 4 + 5 * 6
print 9 / 5  #정수/정수 연산결과는 정수
print 9.0 / 5.0
print 9 / 5.0

	
